synthetos/Motate/MotateProject/motate/cmsis/TARGET_Atmel/sam4l/include/component/gpio.h
/* -------- GPIO_ODERS : (GPIO Offset: 0x044) ( /W 32) port Output Driver Enable Register - Set -------- */
#define GPIO_ODERS_OFFSET           0x044        /**< \brief (GPIO_ODERS offset) Output Driver Enable Register - Set */

#define GPIO_ODERS_P0_Pos           0            /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P0               (0x1u << GPIO_ODERS_P0_Pos)
#define GPIO_ODERS_P1_Pos           1            /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P1               (0x1u << GPIO_ODERS_P1_Pos)
#define GPIO_ODERS_P2_Pos           2            /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P2               (0x1u << GPIO_ODERS_P2_Pos)
#define GPIO_ODERS_P3_Pos           3            /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P3               (0x1u << GPIO_ODERS_P3_Pos)
#define GPIO_ODERS_P4_Pos           4            /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P4               (0x1u << GPIO_ODERS_P4_Pos)
#define GPIO_ODERS_P5_Pos           5            /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P5               (0x1u << GPIO_ODERS_P5_Pos)
#define GPIO_ODERS_P6_Pos           6            /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P6               (0x1u << GPIO_ODERS_P6_Pos)
#define GPIO_ODERS_P7_Pos           7            /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P7               (0x1u << GPIO_ODERS_P7_Pos)
#define GPIO_ODERS_P8_Pos           8            /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P8               (0x1u << GPIO_ODERS_P8_Pos)
#define GPIO_ODERS_P9_Pos           9            /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P9               (0x1u << GPIO_ODERS_P9_Pos)
#define GPIO_ODERS_P10_Pos          10           /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P10              (0x1u << GPIO_ODERS_P10_Pos)
#define GPIO_ODERS_P11_Pos          11           /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P11              (0x1u << GPIO_ODERS_P11_Pos)
#define GPIO_ODERS_P12_Pos          12           /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P12              (0x1u << GPIO_ODERS_P12_Pos)
#define GPIO_ODERS_P13_Pos          13           /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P13              (0x1u << GPIO_ODERS_P13_Pos)
#define GPIO_ODERS_P14_Pos          14           /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P14              (0x1u << GPIO_ODERS_P14_Pos)
#define GPIO_ODERS_P15_Pos          15           /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P15              (0x1u << GPIO_ODERS_P15_Pos)
#define GPIO_ODERS_P16_Pos          16           /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P16              (0x1u << GPIO_ODERS_P16_Pos)
#define GPIO_ODERS_P17_Pos          17           /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P17              (0x1u << GPIO_ODERS_P17_Pos)
#define GPIO_ODERS_P18_Pos          18           /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P18              (0x1u << GPIO_ODERS_P18_Pos)
#define GPIO_ODERS_P19_Pos          19           /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P19              (0x1u << GPIO_ODERS_P19_Pos)
#define GPIO_ODERS_P20_Pos          20           /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P20              (0x1u << GPIO_ODERS_P20_Pos)
#define GPIO_ODERS_P21_Pos          21           /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P21              (0x1u << GPIO_ODERS_P21_Pos)
#define GPIO_ODERS_P22_Pos          22           /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P22              (0x1u << GPIO_ODERS_P22_Pos)
#define GPIO_ODERS_P23_Pos          23           /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P23              (0x1u << GPIO_ODERS_P23_Pos)
#define GPIO_ODERS_P24_Pos          24           /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P24              (0x1u << GPIO_ODERS_P24_Pos)
#define GPIO_ODERS_P25_Pos          25           /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P25              (0x1u << GPIO_ODERS_P25_Pos)
#define GPIO_ODERS_P26_Pos          26           /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P26              (0x1u << GPIO_ODERS_P26_Pos)
#define GPIO_ODERS_P27_Pos          27           /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P27              (0x1u << GPIO_ODERS_P27_Pos)
#define GPIO_ODERS_P28_Pos          28           /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P28              (0x1u << GPIO_ODERS_P28_Pos)
#define GPIO_ODERS_P29_Pos          29           /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P29              (0x1u << GPIO_ODERS_P29_Pos)
#define GPIO_ODERS_P30_Pos          30           /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P30              (0x1u << GPIO_ODERS_P30_Pos)
#define GPIO_ODERS_P31_Pos          31           /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P31              (0x1u << GPIO_ODERS_P31_Pos)
#define GPIO_ODERS_MASK             0xFFFFFFFFu  /**< \brief (GPIO_ODERS) MASK Register */

/* -------- GPIO_ODERC : (GPIO Offset: 0x048) ( /W 32) port Output Driver Enable Register - Clear -------- */
#define GPIO_ODERC_OFFSET           0x048        /**< \brief (GPIO_ODERC offset) Output Driver Enable Register - Clear */

#define GPIO_ODERC_P0_Pos           0            /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P0               (0x1u << GPIO_ODERC_P0_Pos)
#define GPIO_ODERC_P1_Pos           1            /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P1               (0x1u << GPIO_ODERC_P1_Pos)
#define GPIO_ODERC_P2_Pos           2            /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P2               (0x1u << GPIO_ODERC_P2_Pos)
#define GPIO_ODERC_P3_Pos           3            /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P3               (0x1u << GPIO_ODERC_P3_Pos)
#define GPIO_ODERC_P4_Pos           4            /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P4               (0x1u << GPIO_ODERC_P4_Pos)
#define GPIO_ODERC_P5_Pos           5            /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P5               (0x1u << GPIO_ODERC_P5_Pos)
#define GPIO_ODERC_P6_Pos           6            /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P6               (0x1u << GPIO_ODERC_P6_Pos)
#define GPIO_ODERC_P7_Pos           7            /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P7               (0x1u << GPIO_ODERC_P7_Pos)
#define GPIO_ODERC_P8_Pos           8            /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P8               (0x1u << GPIO_ODERC_P8_Pos)
#define GPIO_ODERC_P9_Pos           9            /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P9               (0x1u << GPIO_ODERC_P9_Pos)
#define GPIO_ODERC_P10_Pos          10           /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P10              (0x1u << GPIO_ODERC_P10_Pos)
#define GPIO_ODERC_P11_Pos          11           /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P11              (0x1u << GPIO_ODERC_P11_Pos)
#define GPIO_ODERC_P12_Pos          12           /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P12              (0x1u << GPIO_ODERC_P12_Pos)
#define GPIO_ODERC_P13_Pos          13           /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P13              (0x1u << GPIO_ODERC_P13_Pos)
#define GPIO_ODERC_P14_Pos          14           /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P14              (0x1u << GPIO_ODERC_P14_Pos)
#define GPIO_ODERC_P15_Pos          15           /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P15              (0x1u << GPIO_ODERC_P15_Pos)
#define GPIO_ODERC_P16_Pos          16           /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P16              (0x1u << GPIO_ODERC_P16_Pos)
#define GPIO_ODERC_P17_Pos          17           /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P17              (0x1u << GPIO_ODERC_P17_Pos)
#define GPIO_ODERC_P18_Pos          18           /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P18              (0x1u << GPIO_ODERC_P18_Pos)
#define GPIO_ODERC_P19_Pos          19           /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P19              (0x1u << GPIO_ODERC_P19_Pos)
#define GPIO_ODERC_P20_Pos          20           /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P20              (0x1u << GPIO_ODERC_P20_Pos)
#define GPIO_ODERC_P21_Pos          21           /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P21              (0x1u << GPIO_ODERC_P21_Pos)
#define GPIO_ODERC_P22_Pos          22           /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P22              (0x1u << GPIO_ODERC_P22_Pos)
#define GPIO_ODERC_P23_Pos          23           /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P23              (0x1u << GPIO_ODERC_P23_Pos)
#define GPIO_ODERC_P24_Pos          24           /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P24              (0x1u << GPIO_ODERC_P24_Pos)
#define GPIO_ODERC_P25_Pos          25           /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P25              (0x1u << GPIO_ODERC_P25_Pos)
#define GPIO_ODERC_P26_Pos          26           /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P26              (0x1u << GPIO_ODERC_P26_Pos)
#define GPIO_ODERC_P27_Pos          27           /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P27              (0x1u << GPIO_ODERC_P27_Pos)
#define GPIO_ODERC_P28_Pos          28           /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P28              (0x1u << GPIO_ODERC_P28_Pos)
#define GPIO_ODERC_P29_Pos          29           /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P29              (0x1u << GPIO_ODERC_P29_Pos)
#define GPIO_ODERC_P30_Pos          30           /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P30              (0x1u << GPIO_ODERC_P30_Pos)
#define GPIO_ODERC_P31_Pos          31           /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P31              (0x1u << GPIO_ODERC_P31_Pos)
#define GPIO_ODERC_MASK             0xFFFFFFFFu  /**< \brief (GPIO_ODERC) MASK Register */

/* -------- GPIO_ODERT : (GPIO Offset: 0x04C) ( /W 32) port Output Driver Enable Register - Toggle -------- */
#define GPIO_ODERT_OFFSET           0x04C        /**< \brief (GPIO_ODERT offset) Output Driver Enable Register - Toggle */

#define GPIO_ODERT_P0_Pos           0            /**< \brief (GPIO_ODERT) Output Driver Enable */
#define GPIO_ODERT_P0               (0x1u << GPIO_ODERT_P0_Pos)
#define GPIO_ODERT_P1_Pos           1            /**< \brief (GPIO_ODERT) Output Driver Enable */
#define GPIO_ODERT_P1               (0x1u << GPIO_ODERT_P1_Pos)
#define GPIO_ODERT_P2_Pos           2            /**< \brief (GPIO_ODERT) Output Driver Enable */
#define GPIO_ODERT_P2               (0x1u << GPIO_ODERT_P2_Pos)
#define GPIO_ODERT_P3_Pos           3            /**< \brief (GPIO_ODERT) Output Driver Enable */
#define GPIO_ODERT_P3               (0x1u << GPIO_ODERT_P3_Pos)
#define GPIO_ODERT_P4_Pos           4            /**< \brief (GPIO_ODERT) Output Driver Enable */
#define GPIO_ODERT_P4               (0x1u << GPIO_ODERT_P4_Pos)
#define GPIO_ODERT_P5_Pos           5            /**< \brief (GPIO_ODERT) Output Driver Enable */
#define GPIO_ODERT_P5               (0x1u << GPIO_ODERT_P5_Pos)
#define GPIO_ODERT_P6_Pos           6            /**< \brief (GPIO_ODERT) Output Driver Enable */
#define GPIO_ODERT_P6               (0x1u << GPIO_ODERT_P6_Pos)
#define GPIO_ODERT_P7_Pos           7            /**< \brief (GPIO_ODERT) Output Driver Enable */
#define GPIO_ODERT_P7               (0x1u << GPIO_ODERT_P7_Pos)
#define GPIO_ODERT_P8_Pos           8            /**< \brief (GPIO_ODERT) Output Driver Enable */
#define GPIO_ODERT_P8               (0x1u << GPIO_ODERT_P8_Pos)
#define GPIO_ODERT_P9_Pos           9            /**< \brief (GPIO_ODERT) Output Driver Enable */
#define GPIO_ODERT_P9               (0x1u << GPIO_ODERT_P9_Pos)
#define GPIO_ODERT_P10_Pos          10           /**< \brief (GPIO_ODERT) Output Driver Enable */
#define GPIO_ODERT_P10              (0x1u << GPIO_ODERT_P10_Pos)
#define GPIO_ODERT_P11_Pos          11           /**< \brief (GPIO_ODERT) Output Driver Enable */
#define GPIO_ODERT_P11              (0x1u << GPIO_ODERT_P11_Pos)
#define GPIO_ODERT_P12_Pos          12           /**< \brief (GPIO_ODERT) Output Driver Enable */
#define GPIO_ODERT_P12              (0x1u << GPIO_ODERT_P12_Pos)
#define GPIO_ODERT_P13_Pos          13           /**< \brief (GPIO_ODERT) Output Driver Enable */
#define GPIO_ODERT_P13              (0x1u << GPIO_ODERT_P13_Pos)
#define GPIO_ODERT_P14_Pos          14           /**< \brief (GPIO_ODERT) Output Driver Enable */
#define GPIO_ODERT_P14              (0x1u << GPIO_ODERT_P14_Pos)
#define GPIO_ODERT_P15_Pos          15           /**< \brief (GPIO_ODERT) Output Driver Enable */
#define GPIO_ODERT_P15              (0x1u << GPIO_ODERT_P15_Pos)
#define GPIO_ODERT_P16_Pos          16           /**< \brief (GPIO_ODERT) Output Driver Enable */
#define GPIO_ODERT_P16              (0x1u << GPIO_ODERT_P16_Pos)
#define GPIO_ODERT_P17_Pos          17           /**< \brief (GPIO_ODERT) Output Driver Enable */
#define GPIO_ODERT_P17              (0x1u << GPIO_ODERT_P17_Pos)
#define GPIO_ODERT_P18_Pos          18           /**< \brief (GPIO_ODERT) Output Driver Enable */
#define GPIO_ODERT_P18              (0x1u << GPIO_ODERT_P18_Pos)
#define GPIO_ODERT_P19_Pos          19           /**< \brief (GPIO_ODERT) Output Driver Enable */
#define GPIO_ODERT_P19              (0x1u << GPIO_ODERT_P19_Pos)
#define GPIO_ODERT_P20_Pos          20           /**< \brief (GPIO_ODERT) Output Driver Enable */
#define GPIO_ODERT_P20              (0x1u << GPIO_ODERT_P20_Pos)
#define GPIO_ODERT_P21_Pos          21           /**< \brief (GPIO_ODERT) Output Driver Enable */
#define GPIO_ODERT_P21              (0x1u << GPIO_ODERT_P21_Pos)
#define GPIO_ODERT_P22_Pos          22           /**< \brief (GPIO_ODERT) Output Driver Enable */
#define GPIO_ODERT_P22              (0x1u << GPIO_ODERT_P22_Pos)
#define GPIO_ODERT_P23_Pos          23           /**< \brief (GPIO_ODERT) Output Driver Enable */
#define GPIO_ODERT_P23              (0x1u << GPIO_ODERT_P23_Pos)
#define GPIO_ODERT_P24_Pos          24           /**< \brief (GPIO_ODERT) Output Driver Enable */
#define GPIO_ODERT_P24              (0x1u << GPIO_ODERT_P24_Pos)
#define GPIO_ODERT_P25_Pos          25           /**< \brief (GPIO_ODERT) Output Driver Enable */
#define GPIO_ODERT_P25              (0x1u << GPIO_ODERT_P25_Pos)
#define GPIO_ODERT_P26_Pos          26           /**< \brief (GPIO_ODERT) Output Driver Enable */
#define GPIO_ODERT_P26              (0x1u << GPIO_ODERT_P26_Pos)
#define GPIO_ODERT_P27_Pos          27           /**< \brief (GPIO_ODERT) Output Driver Enable */
#define GPIO_ODERT_P27              (0x1u << GPIO_ODERT_P27_Pos)
#define GPIO_ODERT_P28_Pos          28           /**< \brief (GPIO_ODERT) Output Driver Enable */
#define GPIO_ODERT_P28              (0x1u << GPIO_ODERT_P28_Pos)
#define GPIO_ODERT_P29_Pos          29           /**< \brief (GPIO_ODERT) Output Driver Enable */
#define GPIO_ODERT_P29              (0x1u << GPIO_ODERT_P29_Pos)
#define GPIO_ODERT_P30_Pos          30           /**< \brief (GPIO_ODERT) Output Driver Enable */
#define GPIO_ODERT_P30              (0x1u << GPIO_ODERT_P30_Pos)
#define GPIO_ODERT_P31_Pos          31           /**< \brief (GPIO_ODERT) Output Driver Enable */
#define GPIO_ODERT_P31              (0x1u << GPIO_ODERT_P31_Pos)
#define GPIO_ODERT_MASK             0xFFFFFFFFu  /**< \brief (GPIO_ODERT) MASK Register */

/* -------- GPIO_OVR : (GPIO Offset: 0x050) (R/W 32) port Output Value Register -------- */
#define GPIO_OVR_OFFSET             0x050        /**< \brief (GPIO_OVR offset) Output Value Register */

#define GPIO_OVR_P0_Pos             0            /**< \brief (GPIO_OVR) Output Value */
#define GPIO_OVR_P0                 (0x1u << GPIO_OVR_P0_Pos)
#define GPIO_OVR_P1_Pos             1            /**< \brief (GPIO_OVR) Output Value */
#define GPIO_OVR_P1                 (0x1u << GPIO_OVR_P1_Pos)
#define GPIO_OVR_P2_Pos             2            /**< \brief (GPIO_OVR) Output Value */
#define GPIO_OVR_P2                 (0x1u << GPIO_OVR_P2_Pos)
#define GPIO_OVR_P3_Pos             3            /**< \brief (GPIO_OVR) Output Value */
#define GPIO_OVR_P3                 (0x1u << GPIO_OVR_P3_Pos)
#define GPIO_OVR_P4_Pos             4            /**< \brief (GPIO_OVR) Output Value */
#define GPIO_OVR_P4                 (0x1u << GPIO_OVR_P4_Pos)
#define GPIO_OVR_P5_Pos             5            /**< \brief (GPIO_OVR) Output Value */
#define GPIO_OVR_P5                 (0x1u << GPIO_OVR_P5_Pos)
#define GPIO_OVR_P6_Pos             6            /**< \brief (GPIO_OVR) Output Value */
#define GPIO_OVR_P6                 (0x1u << GPIO_OVR_P6_Pos)
#define GPIO_OVR_P7_Pos             7            /**< \brief (GPIO_OVR) Output Value */
#define GPIO_OVR_P7                 (0x1u << GPIO_OVR_P7_Pos)
#define GPIO_OVR_P8_Pos             8            /**< \brief (GPIO_OVR) Output Value */
#define GPIO_OVR_P8                 (0x1u << GPIO_OVR_P8_Pos)
#define GPIO_OVR_P9_Pos             9            /**< \brief (GPIO_OVR) Output Value */
#define GPIO_OVR_P9                 (0x1u << GPIO_OVR_P9_Pos)
#define GPIO_OVR_P10_Pos            10           /**< \brief (GPIO_OVR) Output Value */
#define GPIO_OVR_P10                (0x1u << GPIO_OVR_P10_Pos)
#define GPIO_OVR_P11_Pos            11           /**< \brief (GPIO_OVR) Output Value */
#define GPIO_OVR_P11                (0x1u << GPIO_OVR_P11_Pos)
#define GPIO_OVR_P12_Pos            12           /**< \brief (GPIO_OVR) Output Value */
#define GPIO_OVR_P12                (0x1u << GPIO_OVR_P12_Pos)
#define GPIO_OVR_P13_Pos            13           /**< \brief (GPIO_OVR) Output Value */
#define GPIO_OVR_P13                (0x1u << GPIO_OVR_P13_Pos)
#define GPIO_OVR_P14_Pos            14           /**< \brief (GPIO_OVR) Output Value */
#define GPIO_OVR_P14                (0x1u << GPIO_OVR_P14_Pos)
#define GPIO_OVR_P15_Pos            15           /**< \brief (GPIO_OVR) Output Value */
#define GPIO_OVR_P15                (0x1u << GPIO_OVR_P15_Pos)
#define GPIO_OVR_P16_Pos            16           /**< \brief (GPIO_OVR) Output Value */
#define GPIO_OVR_P16                (0x1u << GPIO_OVR_P16_Pos)
#define GPIO_OVR_P17_Pos            17           /**< \brief (GPIO_OVR) Output Value */
#define GPIO_OVR_P17                (0x1u << GPIO_OVR_P17_Pos)
#define GPIO_OVR_P18_Pos            18           /**< \brief (GPIO_OVR) Output Value */
#define GPIO_OVR_P18                (0x1u << GPIO_OVR_P18_Pos)
#define GPIO_OVR_P19_Pos            19           /**< \brief (GPIO_OVR) Output Value */
#define GPIO_OVR_P19                (0x1u << GPIO_OVR_P19_Pos)
#define GPIO_OVR_P20_Pos            20           /**< \brief (GPIO_OVR) Output Value */
#define GPIO_OVR_P20                (0x1u << GPIO_OVR_P20_Pos)
#define GPIO_OVR_P21_Pos            21           /**< \brief (GPIO_OVR) Output Value */
#define GPIO_OVR_P21                (0x1u << GPIO_OVR_P21_Pos)
#define GPIO_OVR_P22_Pos            22           /**< \brief (GPIO_OVR) Output Value */
#define GPIO_OVR_P22                (0x1u << GPIO_OVR_P22_Pos)
#define GPIO_OVR_P23_Pos            23           /**< \brief (GPIO_OVR) Output Value */
#define GPIO_OVR_P23                (0x1u << GPIO_OVR_P23_Pos)
#define GPIO_OVR_P24_Pos            24           /**< \brief (GPIO_OVR) Output Value */
#define GPIO_OVR_P24                (0x1u << GPIO_OVR_P24_Pos)
#define GPIO_OVR_P25_Pos            25           /**< \brief (GPIO_OVR) Output Value */
#define GPIO_OVR_P25                (0x1u << GPIO_OVR_P25_Pos)
#define GPIO_OVR_P26_Pos            26           /**< \brief (GPIO_OVR) Output Value */
#define GPIO_OVR_P26                (0x1u << GPIO_OVR_P26_Pos)
#define GPIO_OVR_P27_Pos            27           /**< \brief (GPIO_OVR) Output Value */
#define GPIO_OVR_P27                (0x1u << GPIO_OVR_P27_Pos)
#define GPIO_OVR_P28_Pos            28           /**< \brief (GPIO_OVR) Output Value */
#define GPIO_OVR_P28                (0x1u << GPIO_OVR_P28_Pos)
#define GPIO_OVR_P29_Pos            29           /**< \brief (GPIO_OVR) Output Value */
#define GPIO_OVR_P29                (0x1u << GPIO_OVR_P29_Pos)
#define GPIO_OVR_P30_Pos            30           /**< \brief (GPIO_OVR) Output Value */
#define GPIO_OVR_P30                (0x1u << GPIO_OVR_P30_Pos)
#define GPIO_OVR_P31_Pos            31           /**< \brief (GPIO_OVR) Output Value */
#define GPIO_OVR_P31                (0x1u << GPIO_OVR_P31_Pos)
#define GPIO_OVR_MASK               0xFFFFFFFFu  /**< \brief (GPIO_OVR) MASK Register */

/* -------- GPIO_OVRS : (GPIO Offset: 0x054) ( /W 32) port Output Value Register - Set -------- */
#define GPIO_OVRS_OFFSET            0x054        /**< \brief (GPIO_OVRS offset) Output Value Register - Set */

