synthetos/Motate/MotateProject/motate/cmsis/TARGET_Atmel/sam4l/include/component/gpio.h
#define GPIO_OVRS_P0_Pos            0            /**< \brief (GPIO_OVRS) Output Value */
#define GPIO_OVRS_P0                (0x1u << GPIO_OVRS_P0_Pos)
#define GPIO_OVRS_P1_Pos            1            /**< \brief (GPIO_OVRS) Output Value */
#define GPIO_OVRS_P1                (0x1u << GPIO_OVRS_P1_Pos)
#define GPIO_OVRS_P2_Pos            2            /**< \brief (GPIO_OVRS) Output Value */
#define GPIO_OVRS_P2                (0x1u << GPIO_OVRS_P2_Pos)
#define GPIO_OVRS_P3_Pos            3            /**< \brief (GPIO_OVRS) Output Value */
#define GPIO_OVRS_P3                (0x1u << GPIO_OVRS_P3_Pos)
#define GPIO_OVRS_P4_Pos            4            /**< \brief (GPIO_OVRS) Output Value */
#define GPIO_OVRS_P4                (0x1u << GPIO_OVRS_P4_Pos)
#define GPIO_OVRS_P5_Pos            5            /**< \brief (GPIO_OVRS) Output Value */
#define GPIO_OVRS_P5                (0x1u << GPIO_OVRS_P5_Pos)
#define GPIO_OVRS_P6_Pos            6            /**< \brief (GPIO_OVRS) Output Value */
#define GPIO_OVRS_P6                (0x1u << GPIO_OVRS_P6_Pos)
#define GPIO_OVRS_P7_Pos            7            /**< \brief (GPIO_OVRS) Output Value */
#define GPIO_OVRS_P7                (0x1u << GPIO_OVRS_P7_Pos)
#define GPIO_OVRS_P8_Pos            8            /**< \brief (GPIO_OVRS) Output Value */
#define GPIO_OVRS_P8                (0x1u << GPIO_OVRS_P8_Pos)
#define GPIO_OVRS_P9_Pos            9            /**< \brief (GPIO_OVRS) Output Value */
#define GPIO_OVRS_P9                (0x1u << GPIO_OVRS_P9_Pos)
#define GPIO_OVRS_P10_Pos           10           /**< \brief (GPIO_OVRS) Output Value */
#define GPIO_OVRS_P10               (0x1u << GPIO_OVRS_P10_Pos)
#define GPIO_OVRS_P11_Pos           11           /**< \brief (GPIO_OVRS) Output Value */
#define GPIO_OVRS_P11               (0x1u << GPIO_OVRS_P11_Pos)
#define GPIO_OVRS_P12_Pos           12           /**< \brief (GPIO_OVRS) Output Value */
#define GPIO_OVRS_P12               (0x1u << GPIO_OVRS_P12_Pos)
#define GPIO_OVRS_P13_Pos           13           /**< \brief (GPIO_OVRS) Output Value */
#define GPIO_OVRS_P13               (0x1u << GPIO_OVRS_P13_Pos)
#define GPIO_OVRS_P14_Pos           14           /**< \brief (GPIO_OVRS) Output Value */
#define GPIO_OVRS_P14               (0x1u << GPIO_OVRS_P14_Pos)
#define GPIO_OVRS_P15_Pos           15           /**< \brief (GPIO_OVRS) Output Value */
#define GPIO_OVRS_P15               (0x1u << GPIO_OVRS_P15_Pos)
#define GPIO_OVRS_P16_Pos           16           /**< \brief (GPIO_OVRS) Output Value */
#define GPIO_OVRS_P16               (0x1u << GPIO_OVRS_P16_Pos)
#define GPIO_OVRS_P17_Pos           17           /**< \brief (GPIO_OVRS) Output Value */
#define GPIO_OVRS_P17               (0x1u << GPIO_OVRS_P17_Pos)
#define GPIO_OVRS_P18_Pos           18           /**< \brief (GPIO_OVRS) Output Value */
#define GPIO_OVRS_P18               (0x1u << GPIO_OVRS_P18_Pos)
#define GPIO_OVRS_P19_Pos           19           /**< \brief (GPIO_OVRS) Output Value */
#define GPIO_OVRS_P19               (0x1u << GPIO_OVRS_P19_Pos)
#define GPIO_OVRS_P20_Pos           20           /**< \brief (GPIO_OVRS) Output Value */
#define GPIO_OVRS_P20               (0x1u << GPIO_OVRS_P20_Pos)
#define GPIO_OVRS_P21_Pos           21           /**< \brief (GPIO_OVRS) Output Value */
#define GPIO_OVRS_P21               (0x1u << GPIO_OVRS_P21_Pos)
#define GPIO_OVRS_P22_Pos           22           /**< \brief (GPIO_OVRS) Output Value */
#define GPIO_OVRS_P22               (0x1u << GPIO_OVRS_P22_Pos)
#define GPIO_OVRS_P23_Pos           23           /**< \brief (GPIO_OVRS) Output Value */
#define GPIO_OVRS_P23               (0x1u << GPIO_OVRS_P23_Pos)
#define GPIO_OVRS_P24_Pos           24           /**< \brief (GPIO_OVRS) Output Value */
#define GPIO_OVRS_P24               (0x1u << GPIO_OVRS_P24_Pos)
#define GPIO_OVRS_P25_Pos           25           /**< \brief (GPIO_OVRS) Output Value */
#define GPIO_OVRS_P25               (0x1u << GPIO_OVRS_P25_Pos)
#define GPIO_OVRS_P26_Pos           26           /**< \brief (GPIO_OVRS) Output Value */
#define GPIO_OVRS_P26               (0x1u << GPIO_OVRS_P26_Pos)
#define GPIO_OVRS_P27_Pos           27           /**< \brief (GPIO_OVRS) Output Value */
#define GPIO_OVRS_P27               (0x1u << GPIO_OVRS_P27_Pos)
#define GPIO_OVRS_P28_Pos           28           /**< \brief (GPIO_OVRS) Output Value */
#define GPIO_OVRS_P28               (0x1u << GPIO_OVRS_P28_Pos)
#define GPIO_OVRS_P29_Pos           29           /**< \brief (GPIO_OVRS) Output Value */
#define GPIO_OVRS_P29               (0x1u << GPIO_OVRS_P29_Pos)
#define GPIO_OVRS_P30_Pos           30           /**< \brief (GPIO_OVRS) Output Value */
#define GPIO_OVRS_P30               (0x1u << GPIO_OVRS_P30_Pos)
#define GPIO_OVRS_P31_Pos           31           /**< \brief (GPIO_OVRS) Output Value */
#define GPIO_OVRS_P31               (0x1u << GPIO_OVRS_P31_Pos)
#define GPIO_OVRS_MASK              0xFFFFFFFFu  /**< \brief (GPIO_OVRS) MASK Register */

/* -------- GPIO_OVRC : (GPIO Offset: 0x058) ( /W 32) port Output Value Register - Clear -------- */
#define GPIO_OVRC_OFFSET            0x058        /**< \brief (GPIO_OVRC offset) Output Value Register - Clear */

#define GPIO_OVRC_P0_Pos            0            /**< \brief (GPIO_OVRC) Output Value */
#define GPIO_OVRC_P0                (0x1u << GPIO_OVRC_P0_Pos)
#define GPIO_OVRC_P1_Pos            1            /**< \brief (GPIO_OVRC) Output Value */
#define GPIO_OVRC_P1                (0x1u << GPIO_OVRC_P1_Pos)
#define GPIO_OVRC_P2_Pos            2            /**< \brief (GPIO_OVRC) Output Value */
#define GPIO_OVRC_P2                (0x1u << GPIO_OVRC_P2_Pos)
#define GPIO_OVRC_P3_Pos            3            /**< \brief (GPIO_OVRC) Output Value */
#define GPIO_OVRC_P3                (0x1u << GPIO_OVRC_P3_Pos)
#define GPIO_OVRC_P4_Pos            4            /**< \brief (GPIO_OVRC) Output Value */
#define GPIO_OVRC_P4                (0x1u << GPIO_OVRC_P4_Pos)
#define GPIO_OVRC_P5_Pos            5            /**< \brief (GPIO_OVRC) Output Value */
#define GPIO_OVRC_P5                (0x1u << GPIO_OVRC_P5_Pos)
#define GPIO_OVRC_P6_Pos            6            /**< \brief (GPIO_OVRC) Output Value */
#define GPIO_OVRC_P6                (0x1u << GPIO_OVRC_P6_Pos)
#define GPIO_OVRC_P7_Pos            7            /**< \brief (GPIO_OVRC) Output Value */
#define GPIO_OVRC_P7                (0x1u << GPIO_OVRC_P7_Pos)
#define GPIO_OVRC_P8_Pos            8            /**< \brief (GPIO_OVRC) Output Value */
#define GPIO_OVRC_P8                (0x1u << GPIO_OVRC_P8_Pos)
#define GPIO_OVRC_P9_Pos            9            /**< \brief (GPIO_OVRC) Output Value */
#define GPIO_OVRC_P9                (0x1u << GPIO_OVRC_P9_Pos)
#define GPIO_OVRC_P10_Pos           10           /**< \brief (GPIO_OVRC) Output Value */
#define GPIO_OVRC_P10               (0x1u << GPIO_OVRC_P10_Pos)
#define GPIO_OVRC_P11_Pos           11           /**< \brief (GPIO_OVRC) Output Value */
#define GPIO_OVRC_P11               (0x1u << GPIO_OVRC_P11_Pos)
#define GPIO_OVRC_P12_Pos           12           /**< \brief (GPIO_OVRC) Output Value */
#define GPIO_OVRC_P12               (0x1u << GPIO_OVRC_P12_Pos)
#define GPIO_OVRC_P13_Pos           13           /**< \brief (GPIO_OVRC) Output Value */
#define GPIO_OVRC_P13               (0x1u << GPIO_OVRC_P13_Pos)
#define GPIO_OVRC_P14_Pos           14           /**< \brief (GPIO_OVRC) Output Value */
#define GPIO_OVRC_P14               (0x1u << GPIO_OVRC_P14_Pos)
#define GPIO_OVRC_P15_Pos           15           /**< \brief (GPIO_OVRC) Output Value */
#define GPIO_OVRC_P15               (0x1u << GPIO_OVRC_P15_Pos)
#define GPIO_OVRC_P16_Pos           16           /**< \brief (GPIO_OVRC) Output Value */
#define GPIO_OVRC_P16               (0x1u << GPIO_OVRC_P16_Pos)
#define GPIO_OVRC_P17_Pos           17           /**< \brief (GPIO_OVRC) Output Value */
#define GPIO_OVRC_P17               (0x1u << GPIO_OVRC_P17_Pos)
#define GPIO_OVRC_P18_Pos           18           /**< \brief (GPIO_OVRC) Output Value */
#define GPIO_OVRC_P18               (0x1u << GPIO_OVRC_P18_Pos)
#define GPIO_OVRC_P19_Pos           19           /**< \brief (GPIO_OVRC) Output Value */
#define GPIO_OVRC_P19               (0x1u << GPIO_OVRC_P19_Pos)
#define GPIO_OVRC_P20_Pos           20           /**< \brief (GPIO_OVRC) Output Value */
#define GPIO_OVRC_P20               (0x1u << GPIO_OVRC_P20_Pos)
#define GPIO_OVRC_P21_Pos           21           /**< \brief (GPIO_OVRC) Output Value */
#define GPIO_OVRC_P21               (0x1u << GPIO_OVRC_P21_Pos)
#define GPIO_OVRC_P22_Pos           22           /**< \brief (GPIO_OVRC) Output Value */
#define GPIO_OVRC_P22               (0x1u << GPIO_OVRC_P22_Pos)
#define GPIO_OVRC_P23_Pos           23           /**< \brief (GPIO_OVRC) Output Value */
#define GPIO_OVRC_P23               (0x1u << GPIO_OVRC_P23_Pos)
#define GPIO_OVRC_P24_Pos           24           /**< \brief (GPIO_OVRC) Output Value */
#define GPIO_OVRC_P24               (0x1u << GPIO_OVRC_P24_Pos)
#define GPIO_OVRC_P25_Pos           25           /**< \brief (GPIO_OVRC) Output Value */
#define GPIO_OVRC_P25               (0x1u << GPIO_OVRC_P25_Pos)
#define GPIO_OVRC_P26_Pos           26           /**< \brief (GPIO_OVRC) Output Value */
#define GPIO_OVRC_P26               (0x1u << GPIO_OVRC_P26_Pos)
#define GPIO_OVRC_P27_Pos           27           /**< \brief (GPIO_OVRC) Output Value */
#define GPIO_OVRC_P27               (0x1u << GPIO_OVRC_P27_Pos)
#define GPIO_OVRC_P28_Pos           28           /**< \brief (GPIO_OVRC) Output Value */
#define GPIO_OVRC_P28               (0x1u << GPIO_OVRC_P28_Pos)
#define GPIO_OVRC_P29_Pos           29           /**< \brief (GPIO_OVRC) Output Value */
#define GPIO_OVRC_P29               (0x1u << GPIO_OVRC_P29_Pos)
#define GPIO_OVRC_P30_Pos           30           /**< \brief (GPIO_OVRC) Output Value */
#define GPIO_OVRC_P30               (0x1u << GPIO_OVRC_P30_Pos)
#define GPIO_OVRC_P31_Pos           31           /**< \brief (GPIO_OVRC) Output Value */
#define GPIO_OVRC_P31               (0x1u << GPIO_OVRC_P31_Pos)
#define GPIO_OVRC_MASK              0xFFFFFFFFu  /**< \brief (GPIO_OVRC) MASK Register */

/* -------- GPIO_OVRT : (GPIO Offset: 0x05C) ( /W 32) port Output Value Register - Toggle -------- */
#define GPIO_OVRT_OFFSET            0x05C        /**< \brief (GPIO_OVRT offset) Output Value Register - Toggle */

#define GPIO_OVRT_P0_Pos            0            /**< \brief (GPIO_OVRT) Output Value */
#define GPIO_OVRT_P0                (0x1u << GPIO_OVRT_P0_Pos)
#define GPIO_OVRT_P1_Pos            1            /**< \brief (GPIO_OVRT) Output Value */
#define GPIO_OVRT_P1                (0x1u << GPIO_OVRT_P1_Pos)
#define GPIO_OVRT_P2_Pos            2            /**< \brief (GPIO_OVRT) Output Value */
#define GPIO_OVRT_P2                (0x1u << GPIO_OVRT_P2_Pos)
#define GPIO_OVRT_P3_Pos            3            /**< \brief (GPIO_OVRT) Output Value */
#define GPIO_OVRT_P3                (0x1u << GPIO_OVRT_P3_Pos)
#define GPIO_OVRT_P4_Pos            4            /**< \brief (GPIO_OVRT) Output Value */
#define GPIO_OVRT_P4                (0x1u << GPIO_OVRT_P4_Pos)
#define GPIO_OVRT_P5_Pos            5            /**< \brief (GPIO_OVRT) Output Value */
#define GPIO_OVRT_P5                (0x1u << GPIO_OVRT_P5_Pos)
#define GPIO_OVRT_P6_Pos            6            /**< \brief (GPIO_OVRT) Output Value */
#define GPIO_OVRT_P6                (0x1u << GPIO_OVRT_P6_Pos)
#define GPIO_OVRT_P7_Pos            7            /**< \brief (GPIO_OVRT) Output Value */
#define GPIO_OVRT_P7                (0x1u << GPIO_OVRT_P7_Pos)
#define GPIO_OVRT_P8_Pos            8            /**< \brief (GPIO_OVRT) Output Value */
#define GPIO_OVRT_P8                (0x1u << GPIO_OVRT_P8_Pos)
#define GPIO_OVRT_P9_Pos            9            /**< \brief (GPIO_OVRT) Output Value */
#define GPIO_OVRT_P9                (0x1u << GPIO_OVRT_P9_Pos)
#define GPIO_OVRT_P10_Pos           10           /**< \brief (GPIO_OVRT) Output Value */
#define GPIO_OVRT_P10               (0x1u << GPIO_OVRT_P10_Pos)
#define GPIO_OVRT_P11_Pos           11           /**< \brief (GPIO_OVRT) Output Value */
#define GPIO_OVRT_P11               (0x1u << GPIO_OVRT_P11_Pos)
#define GPIO_OVRT_P12_Pos           12           /**< \brief (GPIO_OVRT) Output Value */
#define GPIO_OVRT_P12               (0x1u << GPIO_OVRT_P12_Pos)
#define GPIO_OVRT_P13_Pos           13           /**< \brief (GPIO_OVRT) Output Value */
#define GPIO_OVRT_P13               (0x1u << GPIO_OVRT_P13_Pos)
#define GPIO_OVRT_P14_Pos           14           /**< \brief (GPIO_OVRT) Output Value */
#define GPIO_OVRT_P14               (0x1u << GPIO_OVRT_P14_Pos)
#define GPIO_OVRT_P15_Pos           15           /**< \brief (GPIO_OVRT) Output Value */
#define GPIO_OVRT_P15               (0x1u << GPIO_OVRT_P15_Pos)
#define GPIO_OVRT_P16_Pos           16           /**< \brief (GPIO_OVRT) Output Value */
#define GPIO_OVRT_P16               (0x1u << GPIO_OVRT_P16_Pos)
#define GPIO_OVRT_P17_Pos           17           /**< \brief (GPIO_OVRT) Output Value */
#define GPIO_OVRT_P17               (0x1u << GPIO_OVRT_P17_Pos)
#define GPIO_OVRT_P18_Pos           18           /**< \brief (GPIO_OVRT) Output Value */
#define GPIO_OVRT_P18               (0x1u << GPIO_OVRT_P18_Pos)
#define GPIO_OVRT_P19_Pos           19           /**< \brief (GPIO_OVRT) Output Value */
#define GPIO_OVRT_P19               (0x1u << GPIO_OVRT_P19_Pos)
#define GPIO_OVRT_P20_Pos           20           /**< \brief (GPIO_OVRT) Output Value */
#define GPIO_OVRT_P20               (0x1u << GPIO_OVRT_P20_Pos)
#define GPIO_OVRT_P21_Pos           21           /**< \brief (GPIO_OVRT) Output Value */
#define GPIO_OVRT_P21               (0x1u << GPIO_OVRT_P21_Pos)
#define GPIO_OVRT_P22_Pos           22           /**< \brief (GPIO_OVRT) Output Value */
#define GPIO_OVRT_P22               (0x1u << GPIO_OVRT_P22_Pos)
#define GPIO_OVRT_P23_Pos           23           /**< \brief (GPIO_OVRT) Output Value */
#define GPIO_OVRT_P23               (0x1u << GPIO_OVRT_P23_Pos)
#define GPIO_OVRT_P24_Pos           24           /**< \brief (GPIO_OVRT) Output Value */
#define GPIO_OVRT_P24               (0x1u << GPIO_OVRT_P24_Pos)
#define GPIO_OVRT_P25_Pos           25           /**< \brief (GPIO_OVRT) Output Value */
#define GPIO_OVRT_P25               (0x1u << GPIO_OVRT_P25_Pos)
#define GPIO_OVRT_P26_Pos           26           /**< \brief (GPIO_OVRT) Output Value */
#define GPIO_OVRT_P26               (0x1u << GPIO_OVRT_P26_Pos)
#define GPIO_OVRT_P27_Pos           27           /**< \brief (GPIO_OVRT) Output Value */
#define GPIO_OVRT_P27               (0x1u << GPIO_OVRT_P27_Pos)
#define GPIO_OVRT_P28_Pos           28           /**< \brief (GPIO_OVRT) Output Value */
#define GPIO_OVRT_P28               (0x1u << GPIO_OVRT_P28_Pos)
#define GPIO_OVRT_P29_Pos           29           /**< \brief (GPIO_OVRT) Output Value */
#define GPIO_OVRT_P29               (0x1u << GPIO_OVRT_P29_Pos)
#define GPIO_OVRT_P30_Pos           30           /**< \brief (GPIO_OVRT) Output Value */
#define GPIO_OVRT_P30               (0x1u << GPIO_OVRT_P30_Pos)
#define GPIO_OVRT_P31_Pos           31           /**< \brief (GPIO_OVRT) Output Value */
#define GPIO_OVRT_P31               (0x1u << GPIO_OVRT_P31_Pos)
#define GPIO_OVRT_MASK              0xFFFFFFFFu  /**< \brief (GPIO_OVRT) MASK Register */

