synthetos/Motate/MotateProject/motate/cmsis/TARGET_Atmel/sam4l/include/component/gpio.h
#define GPIO_EVER_P0_Pos            0            /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P0                (0x1u << GPIO_EVER_P0_Pos)
#define GPIO_EVER_P1_Pos            1            /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P1                (0x1u << GPIO_EVER_P1_Pos)
#define GPIO_EVER_P2_Pos            2            /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P2                (0x1u << GPIO_EVER_P2_Pos)
#define GPIO_EVER_P3_Pos            3            /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P3                (0x1u << GPIO_EVER_P3_Pos)
#define GPIO_EVER_P4_Pos            4            /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P4                (0x1u << GPIO_EVER_P4_Pos)
#define GPIO_EVER_P5_Pos            5            /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P5                (0x1u << GPIO_EVER_P5_Pos)
#define GPIO_EVER_P6_Pos            6            /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P6                (0x1u << GPIO_EVER_P6_Pos)
#define GPIO_EVER_P7_Pos            7            /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P7                (0x1u << GPIO_EVER_P7_Pos)
#define GPIO_EVER_P8_Pos            8            /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P8                (0x1u << GPIO_EVER_P8_Pos)
#define GPIO_EVER_P9_Pos            9            /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P9                (0x1u << GPIO_EVER_P9_Pos)
#define GPIO_EVER_P10_Pos           10           /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P10               (0x1u << GPIO_EVER_P10_Pos)
#define GPIO_EVER_P11_Pos           11           /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P11               (0x1u << GPIO_EVER_P11_Pos)
#define GPIO_EVER_P12_Pos           12           /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P12               (0x1u << GPIO_EVER_P12_Pos)
#define GPIO_EVER_P13_Pos           13           /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P13               (0x1u << GPIO_EVER_P13_Pos)
#define GPIO_EVER_P14_Pos           14           /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P14               (0x1u << GPIO_EVER_P14_Pos)
#define GPIO_EVER_P15_Pos           15           /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P15               (0x1u << GPIO_EVER_P15_Pos)
#define GPIO_EVER_P16_Pos           16           /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P16               (0x1u << GPIO_EVER_P16_Pos)
#define GPIO_EVER_P17_Pos           17           /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P17               (0x1u << GPIO_EVER_P17_Pos)
#define GPIO_EVER_P18_Pos           18           /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P18               (0x1u << GPIO_EVER_P18_Pos)
#define GPIO_EVER_P19_Pos           19           /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P19               (0x1u << GPIO_EVER_P19_Pos)
#define GPIO_EVER_P20_Pos           20           /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P20               (0x1u << GPIO_EVER_P20_Pos)
#define GPIO_EVER_P21_Pos           21           /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P21               (0x1u << GPIO_EVER_P21_Pos)
#define GPIO_EVER_P22_Pos           22           /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P22               (0x1u << GPIO_EVER_P22_Pos)
#define GPIO_EVER_P23_Pos           23           /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P23               (0x1u << GPIO_EVER_P23_Pos)
#define GPIO_EVER_P24_Pos           24           /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P24               (0x1u << GPIO_EVER_P24_Pos)
#define GPIO_EVER_P25_Pos           25           /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P25               (0x1u << GPIO_EVER_P25_Pos)
#define GPIO_EVER_P26_Pos           26           /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P26               (0x1u << GPIO_EVER_P26_Pos)
#define GPIO_EVER_P27_Pos           27           /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P27               (0x1u << GPIO_EVER_P27_Pos)
#define GPIO_EVER_P28_Pos           28           /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P28               (0x1u << GPIO_EVER_P28_Pos)
#define GPIO_EVER_P29_Pos           29           /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P29               (0x1u << GPIO_EVER_P29_Pos)
#define GPIO_EVER_P30_Pos           30           /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P30               (0x1u << GPIO_EVER_P30_Pos)
#define GPIO_EVER_P31_Pos           31           /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P31               (0x1u << GPIO_EVER_P31_Pos)
#define GPIO_EVER_MASK              0xFFFFFFFFu  /**< \brief (GPIO_EVER) MASK Register */

/* -------- GPIO_EVERS : (GPIO Offset: 0x184) ( /W 32) port Event Enable Register - Set -------- */
#define GPIO_EVERS_OFFSET           0x184        /**< \brief (GPIO_EVERS offset) Event Enable Register - Set */

#define GPIO_EVERS_P0_Pos           0            /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P0               (0x1u << GPIO_EVERS_P0_Pos)
#define GPIO_EVERS_P1_Pos           1            /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P1               (0x1u << GPIO_EVERS_P1_Pos)
#define GPIO_EVERS_P2_Pos           2            /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P2               (0x1u << GPIO_EVERS_P2_Pos)
#define GPIO_EVERS_P3_Pos           3            /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P3               (0x1u << GPIO_EVERS_P3_Pos)
#define GPIO_EVERS_P4_Pos           4            /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P4               (0x1u << GPIO_EVERS_P4_Pos)
#define GPIO_EVERS_P5_Pos           5            /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P5               (0x1u << GPIO_EVERS_P5_Pos)
#define GPIO_EVERS_P6_Pos           6            /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P6               (0x1u << GPIO_EVERS_P6_Pos)
#define GPIO_EVERS_P7_Pos           7            /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P7               (0x1u << GPIO_EVERS_P7_Pos)
#define GPIO_EVERS_P8_Pos           8            /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P8               (0x1u << GPIO_EVERS_P8_Pos)
#define GPIO_EVERS_P9_Pos           9            /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P9               (0x1u << GPIO_EVERS_P9_Pos)
#define GPIO_EVERS_P10_Pos          10           /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P10              (0x1u << GPIO_EVERS_P10_Pos)
#define GPIO_EVERS_P11_Pos          11           /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P11              (0x1u << GPIO_EVERS_P11_Pos)
#define GPIO_EVERS_P12_Pos          12           /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P12              (0x1u << GPIO_EVERS_P12_Pos)
#define GPIO_EVERS_P13_Pos          13           /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P13              (0x1u << GPIO_EVERS_P13_Pos)
#define GPIO_EVERS_P14_Pos          14           /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P14              (0x1u << GPIO_EVERS_P14_Pos)
#define GPIO_EVERS_P15_Pos          15           /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P15              (0x1u << GPIO_EVERS_P15_Pos)
#define GPIO_EVERS_P16_Pos          16           /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P16              (0x1u << GPIO_EVERS_P16_Pos)
#define GPIO_EVERS_P17_Pos          17           /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P17              (0x1u << GPIO_EVERS_P17_Pos)
#define GPIO_EVERS_P18_Pos          18           /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P18              (0x1u << GPIO_EVERS_P18_Pos)
#define GPIO_EVERS_P19_Pos          19           /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P19              (0x1u << GPIO_EVERS_P19_Pos)
#define GPIO_EVERS_P20_Pos          20           /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P20              (0x1u << GPIO_EVERS_P20_Pos)
#define GPIO_EVERS_P21_Pos          21           /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P21              (0x1u << GPIO_EVERS_P21_Pos)
#define GPIO_EVERS_P22_Pos          22           /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P22              (0x1u << GPIO_EVERS_P22_Pos)
#define GPIO_EVERS_P23_Pos          23           /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P23              (0x1u << GPIO_EVERS_P23_Pos)
#define GPIO_EVERS_P24_Pos          24           /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P24              (0x1u << GPIO_EVERS_P24_Pos)
#define GPIO_EVERS_P25_Pos          25           /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P25              (0x1u << GPIO_EVERS_P25_Pos)
#define GPIO_EVERS_P26_Pos          26           /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P26              (0x1u << GPIO_EVERS_P26_Pos)
#define GPIO_EVERS_P27_Pos          27           /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P27              (0x1u << GPIO_EVERS_P27_Pos)
#define GPIO_EVERS_P28_Pos          28           /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P28              (0x1u << GPIO_EVERS_P28_Pos)
#define GPIO_EVERS_P29_Pos          29           /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P29              (0x1u << GPIO_EVERS_P29_Pos)
#define GPIO_EVERS_P30_Pos          30           /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P30              (0x1u << GPIO_EVERS_P30_Pos)
#define GPIO_EVERS_P31_Pos          31           /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P31              (0x1u << GPIO_EVERS_P31_Pos)
#define GPIO_EVERS_MASK             0xFFFFFFFFu  /**< \brief (GPIO_EVERS) MASK Register */

